redis_test_for_auto_numa_problem/redis_test_result_L_ON_80G_2nd/memtier_benchmark_L_ON_80G_2nd_Random110_P7_20230624130024.log
20        Threads
5         Connections per thread
900       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        97413.51          ---          ---        29.88007        28.03100        49.66300        67.58300    207669.63 
Gets         9741.31      9741.31         0.00        29.61939        27.90300        48.38300        67.07100     20719.31 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     107154.82      9741.31         0.00        29.85637        28.03100        49.40700        67.58300    228388.93 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       2.287        0.000
SET      24.191        5.000
SET      24.959       10.000
SET      25.343       15.000
SET      25.599       20.000
SET      25.983       25.000
SET      26.239       30.000
SET      26.751       35.000
SET      27.135       40.000
SET      27.519       45.000
SET      28.031       50.000
SET      28.287       52.500
SET      28.543       55.000
SET      28.927       57.500
SET      29.183       60.000
SET      29.567       62.500
SET      29.951       65.000
SET      30.335       67.500
SET      30.847       70.000
SET      31.487       72.500
SET      32.127       75.000
SET      32.383       76.250
SET      32.767       77.500
SET      33.279       78.750
SET      33.535       80.000
SET      34.047       81.250
SET      34.559       82.500
SET      35.071       83.750
SET      35.583       85.000
SET      36.351       86.250
SET      36.863       87.500
SET      37.375       88.125
SET      37.631       88.750
SET      38.143       89.375
SET      38.399       90.000
SET      38.911       90.625
SET      39.423       91.250
SET      39.935       91.875
SET      40.447       92.500
SET      40.959       93.125
SET      41.471       93.750
SET      41.983       94.062
SET      42.239       94.375
SET      42.495       94.688
SET      43.007       95.000
SET      43.263       95.312
SET      43.519       95.625
SET      44.031       95.938
SET      44.287       96.250
SET      44.543       96.562
SET      45.055       96.875
SET      45.311       97.031
SET      45.567       97.188
SET      45.823       97.344
SET      45.823       97.500
SET      46.079       97.656
SET      46.335       97.812
SET      46.591       97.969
SET      47.103       98.125
SET      47.359       98.281
SET      47.615       98.438
SET      47.871       98.516
SET      48.127       98.594
SET      48.383       98.672
SET      48.639       98.750
SET      48.895       98.828
SET      49.151       98.906
SET      49.663       98.984
SET      49.919       99.062
SET      50.431       99.141
SET      50.943       99.219
SET      51.199       99.258
SET      51.455       99.297
SET      51.711       99.336
SET      51.967       99.375
SET      52.479       99.414
SET      52.991       99.453
SET      53.503       99.492
SET      54.015       99.531
SET      54.527       99.570
SET      55.295       99.609
SET      55.551       99.629
SET      56.063       99.648
SET      56.575       99.668
SET      56.831       99.688
SET      57.343       99.707
SET      57.855       99.727
SET      58.367       99.746
SET      59.135       99.766
SET      59.903       99.785
SET      60.927       99.805
SET      61.183       99.814
SET      61.951       99.824
SET      62.207       99.834
SET      62.719       99.844
SET      63.487       99.854
SET      63.999       99.863
SET      64.767       99.873
SET      66.047       99.883
SET      67.071       99.893
SET      68.095       99.902
SET      68.095       99.907
SET      68.607       99.912
SET      69.119       99.917
SET      69.631       99.922
SET      70.143       99.927
SET      71.167       99.932
SET      71.679       99.937
SET      72.703       99.941
SET      73.727       99.946
SET      75.775       99.951
SET      77.311       99.954
SET      77.823       99.956
SET      78.847       99.958
SET      79.871       99.961
SET      82.431       99.963
SET      87.039       99.966
SET     240.639       99.968
SET     248.831       99.971
SET     260.095       99.973
SET     264.191       99.976
SET     266.239       99.977
SET     266.239       99.978
SET     268.287       99.979
SET     272.383       99.980
SET     276.479       99.982
SET     276.479       99.983
SET     278.527       99.984
SET     282.623       99.985
SET     284.671       99.987
SET     284.671       99.988
SET     284.671       99.988
SET     288.767       99.989
SET     288.767       99.990
SET     288.767       99.990
SET     290.815       99.991
SET     290.815       99.991
SET     290.815       99.992
SET     294.911       99.993
SET     296.959       99.993
SET     296.959       99.994
SET     296.959       99.994
SET     296.959       99.995
SET     296.959       99.995
SET     296.959       99.995
[...]
SET     303.103       99.996
SET     303.103       99.996
SET     303.103       99.996
SET     307.199       99.997
SET     307.199       99.997
SET     307.199       99.997
[...]
SET     307.199       99.998
SET     307.199       99.998
SET     307.199       99.998
[...]
SET     309.247       99.998
SET     309.247       99.998
SET     309.247       99.998
SET     309.247       99.999
SET     309.247       99.999
SET     309.247       99.999
[...]
SET     309.247      100.000
SET     309.247      100.000
SET     309.247      100.000
[...]
SET     311.295      100.000
SET     311.295      100.000
SET     313.343      100.000
SET     315.391      100.000
SET     315.391      100.000
SET     315.391      100.000
[...]
SET     325.631      100.000
SET     325.631      100.000
SET     325.631      100.000
[...]
SET     327.679      100.000
SET     327.679      100.000
---
GET       7.583        0.000
GET      24.191        5.000
GET      24.831       10.000
GET      25.215       15.000
GET      25.599       20.000
GET      25.855       25.000
GET      26.239       30.000
GET      26.623       35.000
GET      27.007       40.000
GET      27.391       45.000
GET      27.903       50.000
GET      28.031       52.500
GET      28.415       55.000
GET      28.671       57.500
GET      28.927       60.000
GET      29.311       62.500
GET      29.567       65.000
GET      29.951       67.500
GET      30.335       70.000
GET      30.847       72.500
GET      31.615       75.000
GET      31.871       76.250
GET      32.255       77.500
GET      32.639       78.750
GET      33.023       80.000
GET      33.535       81.250
GET      34.047       82.500
GET      34.559       83.750
GET      35.071       85.000
GET      35.839       86.250
GET      36.351       87.500
GET      36.607       88.125
GET      37.119       88.750
GET      37.631       89.375
GET      37.887       90.000
GET      38.399       90.625
GET      38.911       91.250
GET      39.423       91.875
GET      39.935       92.500
GET      40.447       93.125
GET      40.959       93.750
GET      41.471       94.062
GET      41.727       94.375
GET      41.983       94.688
GET      42.495       95.000
GET      42.751       95.312
GET      43.007       95.625
GET      43.519       95.938
GET      43.775       96.250
GET      44.031       96.562
GET      44.543       96.875
GET      44.799       97.031
GET      44.799       97.188
GET      45.055       97.344
GET      45.311       97.500
GET      45.567       97.656
GET      45.823       97.812
GET      46.079       97.969
GET      46.335       98.125
GET      46.591       98.281
GET      46.847       98.438
GET      47.103       98.516
GET      47.359       98.594
GET      47.359       98.672
GET      47.615       98.750
GET      47.871       98.828
GET      48.127       98.906
GET      48.383       98.984
GET      48.639       99.062
GET      48.895       99.141
GET      49.407       99.219
GET      49.663       99.258
GET      49.919       99.297
GET      50.175       99.336
GET      50.431       99.375
GET      50.687       99.414
GET      50.943       99.453
GET      51.199       99.492
GET      51.455       99.531
GET      51.967       99.570
GET      52.735       99.609
GET      52.991       99.629
GET      53.247       99.648
GET      53.759       99.668
GET      54.271       99.688
GET      54.783       99.707
GET      55.295       99.727
GET      56.319       99.746
GET      56.831       99.766
GET      57.855       99.785
GET      58.879       99.805
GET      59.647       99.814
GET      60.671       99.824
GET      61.183       99.834
GET      61.951       99.844
GET      62.463       99.854
GET      63.231       99.863
GET      63.743       99.873
GET      64.511       99.883
GET      66.047       99.893
GET      67.071       99.902
GET      67.583       99.907
GET      68.095       99.912
GET      68.607       99.917
GET      68.607       99.922
GET      69.631       99.927
GET      70.143       99.932
GET      70.655       99.937
GET      71.679       99.941
GET      72.703       99.946
GET      73.215       99.951
GET      73.727       99.954
GET      74.751       99.956
GET      77.311       99.958
GET      77.823       99.961
GET      78.847       99.963
GET      79.871       99.966
GET     236.543       99.968
GET     240.639       99.971
GET     251.903       99.973
GET     261.119       99.976
GET     264.191       99.977
GET     266.239       99.978
GET     268.287       99.979
GET     274.431       99.980
GET     276.479       99.982
GET     276.479       99.983
GET     278.527       99.984
GET     278.527       99.985
GET     282.623       99.987
GET     284.671       99.988
GET     284.671       99.988
GET     284.671       99.989
GET     284.671       99.990
GET     284.671       99.990
GET     288.767       99.991
GET     288.767       99.991
GET     288.767       99.992
GET     290.815       99.993
GET     290.815       99.993
GET     290.815       99.994
GET     290.815       99.994
GET     294.911       99.995
GET     294.911       99.995
GET     296.959       99.995
GET     296.959       99.995
GET     296.959       99.996
GET     296.959       99.996
GET     296.959       99.996
GET     296.959       99.997
GET     296.959       99.997
GET     296.959       99.997
[...]
GET     296.959       99.998
GET     303.103       99.998
GET     303.103       99.998
GET     303.103       99.998
GET     307.199       99.998
GET     307.199       99.998
GET     307.199       99.998
GET     307.199       99.999
GET     307.199       99.999
GET     307.199       99.999
GET     309.247       99.999
GET     309.247      100.000
---
WAIT      0.000      100.000